000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. LUMI.
000300 DATA DIVISION.
000400 FILE SECTION.
000500 WORKING-STORAGE SECTION.
         01 USERNAME PIC X(10).
000600 PROCEDURE DIVISION.

           DISPLAY "Name: " WITH NO ADVANCING
           ACCEPT USERNAME
           DISPLAY "Hi, " USERNAME

           STOP RUN.
