000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. LUMI.
000300 DATA DIVISION.
000400 FILE SECTION.
000500 WORKING-STORAGE SECTION.
       01 ANS PIC 99.
000600 PROCEDURE DIVISION.
           MOVE ZERO TO ANS
           ADD 1 TO 2 GIVING ANS
           DISPLAY ANS
           STOP RUN.
